Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/atdf/PIC32CM5164LS60048.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08" ioset="2"/>
              <signal group="PAD" index="0" function="D" pad="PA22" ioset="3"/>
              <signal group="PAD" index="0" function="C" pad="PA12" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA09" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PA23" ioset="3"/>
              <signal group="PAD" index="1" function="C" pad="PA13" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA10" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PA20" ioset="3"/>
              <signal group="PAD" index="2" function="D" pad="PA24" ioset="3"/>
              <signal group="PAD" index="2" function="C" pad="PA14" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PA11" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PA21" ioset="3"/>
              <signal group="PAD" index="3" function="D" pad="PA25" ioset="3"/>
              <signal group="PAD" index="3" function="C" pad="PA15" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="8" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="9" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="0" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="19"/>
              <param name="GCLK_ID_SLOW" value="16"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="1" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="67" caption="Instance index for SERCOM2"/>
              <param name="SPI_TX_READY_INT_SRC" value="39" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="40" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="41" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="42" caption="SPI ERROR Interrupt"/>
              <param name="I2C_0_INT_SRC" value="39" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="40" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="41" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="42" caption="I2C 3 Interrupt"/>
              <param name="USART_TX_READY_INT_SRC" value="39" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="40" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="41" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="42" caption="USART ERROR Interrupt"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PB08" ioset="4"/>
              <signal group="PAD" index="0" function="C" pad="PB02" ioset="3"/>
              <signal group="PAD" index="1" function="D" pad="PB09" ioset="4"/>
              <signal group="PAD" index="1" function="C" pad="PB03" ioset="3"/>
              <signal group="PAD" index="2" function="C" pad="PA20" ioset="2 3"/>
              <signal group="PAD" index="3" function="C" pad="PA21" ioset="2 3"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="10" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="11" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="0" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="20"/>
              <param name="GCLK_ID_SLOW" value="16"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="0" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="0" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="1" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="68" caption="Instance index for SERCOM3"/>
              <param name="SPI_TX_READY_INT_SRC" value="43" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="44" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="45" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="46" caption="SPI ERROR Interrupt"/>
              <param name="I2C_0_INT_SRC" value="43" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="44" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="45" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="46" caption="I2C 3 Interrupt"/>
              <param name="USART_TX_READY_INT_SRC" value="43" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="44" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="45" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="46" caption="USART ERROR Interrupt"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA12" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PA13" ioset="2"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="12" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="13" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="0" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="GCLK_ID_SLOW" value="16"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="1" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="69" caption="Instance index for SERCOM4"/>
              <param name="SPI_TX_READY_INT_SRC" value="47" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="48" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="49" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="50" caption="SPI ERROR Interrupt"/>
              <param name="I2C_0_INT_SRC" value="47" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="48" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="49" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="50" caption="I2C 3 Interrupt"/>
              <param name="USART_TX_READY_INT_SRC" value="47" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="48" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="49" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="50" caption="USART ERROR Interrupt"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PB02" ioset="4"/>
              <signal group="PAD" index="1" function="D" pad="PB03" ioset="4"/>
              <signal group="PAD" index="2" function="D" pad="PB22" ioset="2 4"/>
              <signal group="PAD" index="3" function="D" pad="PB23" ioset="2 4"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="14" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="15" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="0" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="GCLK_ID_SLOW" value="16"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="0" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="0" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="1" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="70" caption="Instance index for SERCOM5"/>
              <param name="SPI_TX_READY_INT_SRC" value="51" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="52" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="53" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="54" caption="SPI ERROR Interrupt"/>
              <param name="I2C_0_INT_SRC" value="51" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="52" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="53" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="54" caption="I2C 3 Interrupt"/>
              <param name="USART_TX_READY_INT_SRC" value="51" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="52" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="53" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="54" caption="USART ERROR Interrupt"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="5a0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="HAS_STDBYPL0_BIT" value="1" caption="STDBYPL0 bit is present"/>
              <param name="HAS_LPEFF_BIT" value="1" caption="LPEFF bit is present"/>
              <param name="HAS_SEL_BIT" value="1" caption="SEL bit is present"/>
              <param name="HAS_BOD33_REG_NAME" value="1" caption="Name of BOD register is BOD33"/>
              <param name="HAS_VREFSEL_BIT" value="1" caption="VREFSEL bit is present"/>
              <param name="INSTANCE_ID" value="6" caption="Instance index for SUPC"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
