Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/atdf/PIC32CM5164LS60048.atdf
        <register name="PRICTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="Priority Control">
          <bitfield name="PRI" caption="Channel Priority Number" mask="0x7"/>
          <bitfield name="RREN" caption="Round-Robin Scheduling Enable" mask="0x80"/>
        </register>
        <register name="INTPEND" offset="0x10" rw="RW" size="2" initval="0x4000" caption="Channel Pending Interrupt">
          <bitfield name="ID" caption="Channel ID" mask="0x7"/>
          <bitfield name="OVR" caption="Channel Overrun" mask="0x100"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x200"/>
          <bitfield name="READY" caption="Ready" mask="0x4000"/>
          <bitfield name="BUSY" caption="Busy" mask="0x8000"/>
        </register>
        <register name="INTSTATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Interrupt Status">
          <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1"/>
          <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2"/>
          <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4"/>
          <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8"/>
          <bitfield name="CHINT4" caption="Channel 4 Pending Interrupt" mask="0x10"/>
          <bitfield name="CHINT5" caption="Channel 5 Pending Interrupt" mask="0x20"/>
          <bitfield name="CHINT6" caption="Channel 6 Pending Interrupt" mask="0x40"/>
          <bitfield name="CHINT7" caption="Channel 7 Pending Interrupt" mask="0x80"/>
        </register>
        <register name="BUSYCH" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
          <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10"/>
          <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20"/>
          <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40"/>
          <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80"/>
        </register>
        <register name="READYUSR" offset="0x1C" rw="R" size="4" initval="0xFFFFFFFF" caption="Ready Users">
          <bitfield name="READYUSR0" caption="Ready User for Channel 0" mask="0x1"/>
          <bitfield name="READYUSR1" caption="Ready User for Channel 1" mask="0x2"/>
          <bitfield name="READYUSR2" caption="Ready User for Channel 2" mask="0x4"/>
          <bitfield name="READYUSR3" caption="Ready User for Channel 3" mask="0x8"/>
          <bitfield name="READYUSR4" caption="Ready User for Channel 4" mask="0x10"/>
          <bitfield name="READYUSR5" caption="Ready User for Channel 5" mask="0x20"/>
          <bitfield name="READYUSR6" caption="Ready User for Channel 6" mask="0x40"/>
          <bitfield name="READYUSR7" caption="Ready User for Channel 7" mask="0x80"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x020" size="0x8" count="12"/>
        <register name="USER" offset="0x120" rw="RW" size="1" count="52" initval="0x00" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0xF"/>
        </register>
        <register name="INTENCLR" offset="0x1D4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="NSCHK" caption="Non-Secure Check Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x1D5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="NSCHK" caption="Non-Secure Check Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x1D6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="NSCHK" caption="Non-Secure Check" mask="0x1"/>
        </register>
        <register name="NONSECCHAN" offset="0x1D8" rw="RW" size="4" initval="0x00000000" caption="Channels Security Attribution">
          <bitfield name="CHANNEL0" caption="Non-Secure for Channel 0" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Non-Secure for Channel 1" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Non-Secure for Channel 2" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Non-Secure for Channel 3" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Non-Secure for Channel 4" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Non-Secure for Channel 5" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Non-Secure for Channel 6" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Non-Secure for Channel 7" mask="0x80"/>
          <bitfield name="CHANNEL8" caption="Non-Secure for Channel 8" mask="0x100"/>
          <bitfield name="CHANNEL9" caption="Non-Secure for Channel 9" mask="0x200"/>
          <bitfield name="CHANNEL10" caption="Non-Secure for Channel 10" mask="0x400"/>
          <bitfield name="CHANNEL11" caption="Non-Secure for Channel 11" mask="0x800"/>
        </register>
        <register name="NSCHKCHAN" offset="0x1DC" rw="RW" size="4" initval="0x00000000" caption="Non-Secure Channels Check">
          <bitfield name="CHANNEL0" caption="Channel 0 to be checked as non-secured" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 to be checked as non-secured" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 to be checked as non-secured" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 to be checked as non-secured" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 to be checked as non-secured" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 to be checked as non-secured" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 to be checked as non-secured" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 to be checked as non-secured" mask="0x80"/>
          <bitfield name="CHANNEL8" caption="Channel 8 to be checked as non-secured" mask="0x100"/>
          <bitfield name="CHANNEL9" caption="Channel 9 to be checked as non-secured" mask="0x200"/>
          <bitfield name="CHANNEL10" caption="Channel 10 to be checked as non-secured" mask="0x400"/>
          <bitfield name="CHANNEL11" caption="Channel 11 to be checked as non-secured" mask="0x800"/>
        </register>
        <register name="NONSECUSER0" offset="0x1E0" rw="RW" size="4" initval="0x00000000" caption="Users Security Attribution">
          <bitfield name="USER0" caption="Non-Secure for User 0" mask="0x1"/>
          <bitfield name="USER1" caption="Non-Secure for User 1" mask="0x2"/>
          <bitfield name="USER2" caption="Non-Secure for User 2" mask="0x4"/>
          <bitfield name="USER3" caption="Non-Secure for User 3" mask="0x8"/>
          <bitfield name="USER4" caption="Non-Secure for User 4" mask="0x10"/>
          <bitfield name="USER5" caption="Non-Secure for User 5" mask="0x20"/>
          <bitfield name="USER6" caption="Non-Secure for User 6" mask="0x40"/>
          <bitfield name="USER7" caption="Non-Secure for User 7" mask="0x80"/>
          <bitfield name="USER8" caption="Non-Secure for User 8" mask="0x100"/>
          <bitfield name="USER9" caption="Non-Secure for User 9" mask="0x200"/>
          <bitfield name="USER10" caption="Non-Secure for User 10" mask="0x400"/>
          <bitfield name="USER11" caption="Non-Secure for User 11" mask="0x800"/>
          <bitfield name="USER12" caption="Non-Secure for User 12" mask="0x1000"/>
          <bitfield name="USER13" caption="Non-Secure for User 13" mask="0x2000"/>
          <bitfield name="USER14" caption="Non-Secure for User 14" mask="0x4000"/>
          <bitfield name="USER15" caption="Non-Secure for User 15" mask="0x8000"/>
          <bitfield name="USER16" caption="Non-Secure for User 16" mask="0x10000"/>
          <bitfield name="USER17" caption="Non-Secure for User 17" mask="0x20000"/>
          <bitfield name="USER18" caption="Non-Secure for User 18" mask="0x40000"/>
          <bitfield name="USER19" caption="Non-Secure for User 19" mask="0x80000"/>
          <bitfield name="USER20" caption="Non-Secure for User 20" mask="0x100000"/>
          <bitfield name="USER21" caption="Non-Secure for User 21" mask="0x200000"/>
          <bitfield name="USER22" caption="Non-Secure for User 22" mask="0x400000"/>
          <bitfield name="USER23" caption="Non-Secure for User 23" mask="0x800000"/>
          <bitfield name="USER24" caption="Non-Secure for User 24" mask="0x1000000"/>
          <bitfield name="USER25" caption="Non-Secure for User 25" mask="0x2000000"/>
          <bitfield name="USER26" caption="Non-Secure for User 26" mask="0x4000000"/>
          <bitfield name="USER27" caption="Non-Secure for User 27" mask="0x8000000"/>
          <bitfield name="USER28" caption="Non-Secure for User 28" mask="0x10000000"/>
          <bitfield name="USER29" caption="Non-Secure for User 29" mask="0x20000000"/>
          <bitfield name="USER30" caption="Non-Secure for User 30" mask="0x40000000"/>
          <bitfield name="USER31" caption="Non-Secure for User 31" mask="0x80000000"/>
        </register>
        <register name="NONSECUSER1" offset="0x1E4" rw="RW" size="4" initval="0x00000000" caption="Users Security Attribution">
          <bitfield name="USER32" caption="Non-Secure for User 32" mask="0x1"/>
          <bitfield name="USER33" caption="Non-Secure for User 33" mask="0x2"/>
          <bitfield name="USER34" caption="Non-Secure for User 34" mask="0x4"/>
          <bitfield name="USER35" caption="Non-Secure for User 35" mask="0x8"/>
          <bitfield name="USER36" caption="Non-Secure for User 36" mask="0x10"/>
          <bitfield name="USER37" caption="Non-Secure for User 37" mask="0x20"/>
          <bitfield name="USER38" caption="Non-Secure for User 38" mask="0x40"/>
          <bitfield name="USER39" caption="Non-Secure for User 39" mask="0x80"/>
          <bitfield name="USER40" caption="Non-Secure for User 40" mask="0x100"/>
          <bitfield name="USER41" caption="Non-Secure for User 41" mask="0x200"/>
          <bitfield name="USER42" caption="Non-Secure for User 42" mask="0x400"/>
          <bitfield name="USER43" caption="Non-Secure for User 43" mask="0x800"/>
          <bitfield name="USER44" caption="Non-Secure for User 44" mask="0x1000"/>
          <bitfield name="USER45" caption="Non-Secure for User 45" mask="0x2000"/>
          <bitfield name="USER46" caption="Non-Secure for User 46" mask="0x4000"/>
          <bitfield name="USER47" caption="Non-Secure for User 47" mask="0x8000"/>
          <bitfield name="USER48" caption="Non-Secure for User 48" mask="0x10000"/>
          <bitfield name="USER49" caption="Non-Secure for User 49" mask="0x20000"/>
          <bitfield name="USER50" caption="Non-Secure for User 50" mask="0x40000"/>
          <bitfield name="USER51" caption="Non-Secure for User 51" mask="0x80000"/>
        </register>
        <register name="NSCHKUSER0" offset="0x1F0" rw="RW" size="4" initval="0x00000000" caption="Non-Secure Users Check">
          <bitfield name="USER0" caption="User 0 to be checked as non-secured" mask="0x1"/>
          <bitfield name="USER1" caption="User 1 to be checked as non-secured" mask="0x2"/>
          <bitfield name="USER2" caption="User 2 to be checked as non-secured" mask="0x4"/>
          <bitfield name="USER3" caption="User 3 to be checked as non-secured" mask="0x8"/>
          <bitfield name="USER4" caption="User 4 to be checked as non-secured" mask="0x10"/>
          <bitfield name="USER5" caption="User 5 to be checked as non-secured" mask="0x20"/>
          <bitfield name="USER6" caption="User 6 to be checked as non-secured" mask="0x40"/>
          <bitfield name="USER7" caption="User 7 to be checked as non-secured" mask="0x80"/>
          <bitfield name="USER8" caption="User 8 to be checked as non-secured" mask="0x100"/>
          <bitfield name="USER9" caption="User 9 to be checked as non-secured" mask="0x200"/>
          <bitfield name="USER10" caption="User 10 to be checked as non-secured" mask="0x400"/>
          <bitfield name="USER11" caption="User 11 to be checked as non-secured" mask="0x800"/>
          <bitfield name="USER12" caption="User 12 to be checked as non-secured" mask="0x1000"/>
          <bitfield name="USER13" caption="User 13 to be checked as non-secured" mask="0x2000"/>
          <bitfield name="USER14" caption="User 14 to be checked as non-secured" mask="0x4000"/>
          <bitfield name="USER15" caption="User 15 to be checked as non-secured" mask="0x8000"/>
          <bitfield name="USER16" caption="User 16 to be checked as non-secured" mask="0x10000"/>
          <bitfield name="USER17" caption="User 17 to be checked as non-secured" mask="0x20000"/>
          <bitfield name="USER18" caption="User 18 to be checked as non-secured" mask="0x40000"/>
          <bitfield name="USER19" caption="User 19 to be checked as non-secured" mask="0x80000"/>
          <bitfield name="USER20" caption="User 20 to be checked as non-secured" mask="0x100000"/>
          <bitfield name="USER21" caption="User 21 to be checked as non-secured" mask="0x200000"/>
          <bitfield name="USER22" caption="User 22 to be checked as non-secured" mask="0x400000"/>
          <bitfield name="USER23" caption="User 23 to be checked as non-secured" mask="0x800000"/>
          <bitfield name="USER24" caption="User 24 to be checked as non-secured" mask="0x1000000"/>
          <bitfield name="USER25" caption="User 25 to be checked as non-secured" mask="0x2000000"/>
          <bitfield name="USER26" caption="User 26 to be checked as non-secured" mask="0x4000000"/>
          <bitfield name="USER27" caption="User 27 to be checked as non-secured" mask="0x8000000"/>
          <bitfield name="USER28" caption="User 28 to be checked as non-secured" mask="0x10000000"/>
          <bitfield name="USER29" caption="User 29 to be checked as non-secured" mask="0x20000000"/>
          <bitfield name="USER30" caption="User 30 to be checked as non-secured" mask="0x40000000"/>
          <bitfield name="USER31" caption="User 31 to be checked as non-secured" mask="0x80000000"/>
        </register>
        <register name="NSCHKUSER1" offset="0x1F4" rw="RW" size="4" initval="0x00000000" caption="Non-Secure Users Check">
          <bitfield name="USER32" caption="User 32 to be checked as non-secured" mask="0x1"/>
          <bitfield name="USER33" caption="User 33 to be checked as non-secured" mask="0x2"/>
          <bitfield name="USER34" caption="User 34 to be checked as non-secured" mask="0x4"/>
          <bitfield name="USER35" caption="User 35 to be checked as non-secured" mask="0x8"/>
          <bitfield name="USER36" caption="User 36 to be checked as non-secured" mask="0x10"/>
          <bitfield name="USER37" caption="User 37 to be checked as non-secured" mask="0x20"/>
          <bitfield name="USER38" caption="User 38 to be checked as non-secured" mask="0x40"/>
          <bitfield name="USER39" caption="User 39 to be checked as non-secured" mask="0x80"/>
          <bitfield name="USER40" caption="User 40 to be checked as non-secured" mask="0x100"/>
          <bitfield name="USER41" caption="User 41 to be checked as non-secured" mask="0x200"/>
          <bitfield name="USER42" caption="User 42 to be checked as non-secured" mask="0x400"/>
          <bitfield name="USER43" caption="User 43 to be checked as non-secured " mask="0x800"/>
          <bitfield name="USER44" caption="User 44 to be checked as non-secured" mask="0x1000"/>
          <bitfield name="USER45" caption="User 45 to be checked as non-secured" mask="0x2000"/>
          <bitfield name="USER46" caption="User 46 to be checked as non-secured" mask="0x4000"/>
          <bitfield name="USER47" caption="User 47 to be checked as non-secured" mask="0x8000"/>
          <bitfield name="USER48" caption="User 48 to be checked as non-secured" mask="0x10000"/>
          <bitfield name="USER49" caption="User 49 to be checked as non-secured" mask="0x20000"/>
          <bitfield name="USER50" caption="User 50 to be checked as non-secured" mask="0x40000"/>
          <bitfield name="USER51" caption="User 51 to be checked as non-secured" mask="0x80000"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="FPB" version="1.0.0" caption="Flash Patch and Breakpoint">
      <register-group name="FPB" caption="Flash Patch and Breakpoint">
        <register name="FP_CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Flash Patch Control Register">
          <bitfield name="ENABLE" caption="Flash Patch global enable" mask="0x1"/>
          <bitfield name="KEY" caption="FP_CTRL write-enable key" mask="0x2"/>
          <bitfield name="NUM_CODE" caption="Number of implemented code comparators bits [3:0]" mask="0xF0"/>
          <bitfield name="NUM_LIT" caption="Number of literal comparators" mask="0xF00"/>
          <bitfield name="NUM_CODE_1" caption="Number of implemented code comparators bits [6:4]" mask="0x7000"/>
          <bitfield name="REV" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="FP_REMAP" offset="0x4" rw="R" size="4" access-size="4" caption="Flash Patch Remap Register">
          <bitfield name="REMAP" caption="Remap address" mask="0x1FFFFFE0"/>
          <bitfield name="RMPSPT" caption="Remap supported" mask="0x20000000"/>
        </register>
        <register name="FP_COMP" offset="0x8" rw="RW" size="4" access-size="4" count="4" caption="Flash Patch Comparator Register n">
          <mode name="BREAKPOINT"/>
          <mode name="DEFAULT"/>
          <bitfield name="BE" caption="Breakpoint enable" mask="0x1"/>
          <bitfield modes="DEFAULT" name="FPADDR" caption="Flash Patch address" mask="0x1FFFFFFC"/>
          <bitfield modes="DEFAULT" name="FE" caption="Flash Patch enable" mask="0x80000000"/>
          <bitfield modes="BREAKPOINT" name="BPADDR" caption="Breakpoint address" mask="0xFFFFFFFE"/>
        </register>
        <register name="FP_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="FPB Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="FPB_FP_LAR__KEY"/>
        </register>
        <register name="FP_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="FPB Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="FP_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A03" caption="FPB Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
